[
  {
    "date": "Mar 1",
    "title": "Looking for that someone who wants engage in sexual activity but not sex.",
    "text": "Looking to keep wearing my promise ring in honesty but stop feeling horny as fuck."
  },
  {
    "date": "Mar 1",
    "title": "I Scratch Your Back You Scratch Mine",
    "text": "Actually though. Looking for someone to exchange back massages with. I'm pretty good. Would love someone to help me with my knotty back and not charge me 8 million dollars. Please don't be creepy about it. "
  },  
  {
    "date": "Mar 1",
    "title": "Seeking a Nerdy-Hot Professor ",
    "text": "I am looking to spend time with a humanities professor. We can talk about intellectual things... or not talk at all. I'm excited to explore the power dynamics of professor-student, male-female, and how sexual intrigue can complicate them. "
  },
  {
    "date": "Mar 1",
    "title": "Seeking Someone Who Wants to be Read Stories",
    "text": "I love reading stories aloud. Sometimes, when my housemates are gone, I'll open up my favorite passages in literature and read them aloud in my room. I'm seeking someone who wants to be read books in a quiet place -- I think it can be an incredibly powerful experience. "
  },
  {
    "date": "Mar 1",
    "title": "dweeby/nerdy math tutor who is unaware of his effect on women",
    "text": "Must be endearingly awkward. His smolder is unintentional but potent. He can help me with my math learning difficulties. "
  },
  {
    "date": "Mar 1",
    "title": "Seeking: gender ambiguous anal coitus experience",
    "text": "I swing low and both ways. I take and I give. Seeking my worst nightmare and darkest desire. Save me from myself. "
  },
    {
    "date": "Mar 1",
    "title": "Where are you hiding, hipster other half?",
    "text": "Do you wear black turtlenecks? Do you prefer the films of Ingmar Bergman because there aren't enough weighty silences in Godard's? Do you have one (or more) velvet underground bootlegs on vinyl, preferably originally pressed in Japan? Do you act like the Pixies are the best band from Boston, but usually you'd rather cuddle and listen to Galaxie 500? Where are you hipster other half???"
  }
]